# Books (Core)

# ERD

![png](Images/favorite_books_erd.png)

# Create the database

In [1]:
# imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd

In [2]:
# create connection string
# format:
# connection = "dialect_driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"

In [3]:
# create engine
engine = create_engine(connection)

In [4]:
# create new database if doesn't exist
if database_exists(connection) == False:
    create_database(connection)
else:
    print("The database already exists.")

The database already exists.

# Add users table

In [5]:
# read in users csv
users = pd.read_csv('Data/users.csv')

# check
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [6]:
# add table
# this code replaces table if already exists; alternate is
# to 'append'
users.to_sql('users', engine, if_exists = 'replace')

3

In [7]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Add books table

In [8]:
# read in users csv
books = pd.read_csv('Data/books.csv')

# check
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
# add table
# this code replaces table if already exists; alternate is
# to 'append'
books.to_sql('books', engine, if_exists = 'replace')

6

In [10]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Add authors table

In [11]:
# read in users csv
authors = pd.read_csv('Data/authors.csv')

# check
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
# add table
# this code replaces table if already exists; alternate is
# to 'append'
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [13]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Add favorites table

In [14]:
# read in users csv
favorites = pd.read_csv('Data/favorites.csv')

# check
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [15]:
# add table
# this code replaces table if already exists; alternate is
# to 'append'
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [16]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Practice query

Write query to list all of John Doe's favorite books.

In [17]:
q = """
SELECT b.title, f.user_id
FROM books AS b
JOIN favorites AS f
ON b.id = f.book_id
WHERE f.user_id = 
    (SELECT u.id 
    FROM users AS u 
    WHERE u.last_name = "Doe" 
    AND u.first_name = "John");
"""

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1